In [1]:
import pandas as pd
print(pd.__version__)

1.0.5

In [2]:
data = {
    "names":["길동","둘리","철수"],
    "age":[20,10,40],
    "addr":['서울','경기','부산']
    
}

#dataframe 객체 생성
data_df = pd.DataFrame(data)
#data_df.head(2)
data_df.tail(2)

  names  age addr
1    둘리   10   경기
2    철수   40   부산

In [3]:
print('몇행 몇열---- ' , data_df.shape)
print('컬럼명----', data_df.columns)
print('인덱스----', data_df.index)
print('값들----', data_df.values, type(data_df.values))

몇행 몇열----  (3, 3)
컬럼명---- Index(['names', 'age', 'addr'], dtype='object')
인덱스---- RangeIndex(start=0, stop=3, step=1)
값들---- [['길동' 20 '서울']
 ['둘리' 10 '경기']
 ['철수' 40 '부산']] <class 'numpy.ndarray'>

In [4]:
data_df.iterrows()

for idx, row in data_df.iterrows(): #행에서 rowdata 빼낼때 쓰는 것.? 컬럼을 빼낼때 컬럼값을 빼낼떄
    print(idx,row['addr'])

#$$$

0 서울
1 경기
2 부산

In [5]:
#컬럼 추가

data_df['phone']=['010-11','011-22','223-36']
data_df


#$$$

  names  age addr   phone
0    길동   20   서울  010-11
1    둘리   10   경기  011-22
2    철수   40   부산  223-36

In [6]:
ddata_df.info()

NameError: name 'ddata_df' is not defined

In [18]:
data_df.head()

컬럼추가는....딕셔너리인가?

data_df['성별'] = ['남','여','남']
data_df

  names  age addr   phone 성별
0    길동   20   서울  010-11  남
1    둘리   10   경기  011-22  여
2    철수   40   부산  223-36  남

In [10]:
#집계함수 사용





#나이 최대값, 최소, 평균, 중간
print('최대', data_df['age'].max())
print('최소', data_df['age'].min())
print('평균', data_df['age'].mean())
print('중간', data_df['age'].median())
print('합계', data_df['age'].sum())

최대 40
최소 10
평균 23.333333333333332
중간 20.0
합계 70

In [9]:
data_df.describe()

             age
count   3.000000
mean   23.333333
std    15.275252
min    10.000000
25%    15.000000
50%    20.000000
75%    30.000000
max    40.000000

In [7]:
#네임 컬럼의 값들을 선택해라  시리즈값이 여러개 있는것이 데이터 프레임이다 ` 
#한개의 열colyms 을 선택
print(type(data_df['names']))


data_df['names']

<class 'pandas.core.series.Series'>

0    길동
1    둘리
2    철수
Name: names, dtype: object

In [8]:
#한개의 행(로우)를 선택
print(type(data_df.loc[0]))
data_df.loc[0]

<class 'pandas.core.series.Series'>

names        길동
age          20
addr         서울
phone    010-11
Name: 0, dtype: object

In [ ]:
#SEries 객체생성
series1= pd.Series([10,20,30])
series1

In [ ]:
series2= pd.Series({'title':'dynamite','가수':'방탄'}) #객체 만들기이
series2

In [ ]:
song_list=[
    {'title':'dynamite','가수':'방탄'},
    {'title':'chewing gum','가수':'nct'}
]

song_list

#empty 한 비어있는 dataframe 객체
data_df= pd.DataFrame(columns=['title','가수'])
data_df

In [ ]:
for song in song_list:
    #시리즈 객체 만드는중.......serires 객체 생성
    series_obj = pd.Series(song)
    #series 객체를 dataframe 객체에 추가한다. 
    data_df = data_df.append(series_obj, ignore_index=True)
    
data_df